const OBJECT_COUNT = 25;
const PHOTO_COUNT = { min: 1, max: 25 };
const LIKES_COUNT = { min: 15, max: 200 };
const COMMENTS_COUNT = { min: 0, max: 30 };
const AVATAR_COUNT = { min: 0, max: 6 };

const DESCRIPTION = [
  'На Алтае',
  'В Москве',
  'На работе',
  'Отдыхаю',
  'Пишу код',
  'Учусь',
  'Путешествую',
  'Смотрю сериалы',
  'Гуляю',
  'Читаю',
];

const MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!',
];

const AUTHOR = [
  'Анна Петрова',
  'Сергей Иванов',
  'Мария Смирнова',
  'Дмитрий Кузнецов',
  'Екатерина Попова',
  'Алексей Соколов',
  'Татьяна Лебедева',
  'Михаил Новиков',
  'Наталья Волкова',
  'Андрей Морозов',
  'Ольга Федорович',
  'Денис Ковалев',
  'Юлия Алексеева',
  'Максим Степанов',
  'Ирина Орлова',
  'Владимир Сергеев',
  'Полина Голубева',
  'Антон Романов',
  'Александра Андреева',
  'Евгений Дмитриев',
  'Дарья Иванова',
  'Григорий Захаров',
  'Вероника Кузнецова',
  'Артем Карпов',
  'Ксения Васильева',
];

export {
  COMMENTS_COUNT,
  AVATAR_COUNT,
  DESCRIPTION,
  MESSAGES,
  AUTHOR,
  LIKES_COUNT,
  OBJECT_COUNT,
  PHOTO_COUNT,
};
